{
    "title": "Interactive Media Products",
    "bordercolor": "#D77C79",
    "imagefile": "",
    "description": "Overal reflection: This semester, I've learned the importance of staying informed about current trends in design and interactive media.  Experimenting with interactive elements in my projects has been a rewarding challenge, allowing me to explore new ways of engaging users with the brand identity. Not every project has been able to get to the same level of interactivity but we each had our own tasks.",
    "pagecontent": "",
    "projects": [
        {
            "title": "Soundwave Studio",
            "imagefile": "images/project1.jpg",
            "imagelink": "projects/group/soundwave/brandguide/brandguide.html",
            "description": "Group project 1",
            "projectcontent": "For Soundwave Studio I have done research on the current trends in logo design and how radio stations or audio studios often have their logos designed. I’ve also made proof of concepts for the brandguide. And the entire brandguide itself \n\n **Orientation and Research**:  In line with the Soundwave Studio project, I conducted research on current trends in logo design, particularly focusing on styles prevalent within the radio and audio studio landscape. Additionally, I explored interactive media trends in music streaming platforms and music website design to gain insights into how user engagement could be fostered within the brand identity. \n\n**Interactive Media Product**:  Due to the nature of a brandguide, the process for designing it is a bit different from normal interactive products. It was mainly made in Affinity Publisher. It’s something that should be printed out so interactivity is hard to incorporate. \n\n **Testing**: The prototype was then tested with // to gather feedback on usability and effectiveness in conveying the brand identity. \n\n**Reflection**: \n\n**Click on the image to see the brandguide**"
        },
        {
            "title": "Fontys OVP",
            "imagefile": "images/project2.jpg",
            "imagelink": "projects/group/soundwave/personas/personas.html",
            "description": "This project was all about interactivity, our group needed to create an interactive result that will be intriguing to users.",
            "projectcontent": "**Personas:** Based on preliminary research [LINK] have developed two different personas that fit with the goal of our project. These two personas differ from each other in terms of age, background, and goals. This is great for getting a feel for the kind of people that are attracted to this study and how we can incorporate them into the redesign of the website. I've identified a target audience that might appreciate subtle, nerdy easter eggs. This informed the decision to include the Konami code as a form of unobtrusive interactivity.\n\nThe redesigned OVP site uses interactivity in the form of easter eggs, in this case a rather nerdy one. Seeing as the site has ‘professionals’ as a target audience, an ‘in your face’ easter egg seems out of place. Instead, when inputting the Konami code, the site is ‘matrixified’. The Konami code is one easter egg that’s often used in websites because it’s both unobtrusive and fun for people who know to look for it. \n\n**Figma:** I used the Figma created by Louis as a basis for the website’s design.[link to Figma: https://www.figma.com/design/fYWNeY0iyvJSwSCjAQ3nBR/Fontys-ICT-deeltijd-websiite?node-id=0-1&t=Xk8zCPgHgxlgfUKB-0] \n\n**User testing:**Penny: The final programmed website has been tested by Penny, who also tested the original website as part of an observation. The results of that observation have been taken into account while designing the new site. For example, the number of clicks needed to find relevant information has been reduced. The observation of the original site consisted of [TEST RESULTS OF 2024-05-23 HERE] Our most important finding was that she noted that it’s good that information is found in multiple places but that wording of some areas were too vague. For example, we asked her to find testimonials of ex-students. Those are located on the main page, but due to it not having a clear title, she had difficulty in finding them. With the easter egg, she and many others noted that it might be too difficult to find for the average person. We noticed in testing that she and others start clicking around on the page to try to find the easter egg. This resulted in creating an additional easter egg for Others: We also tested the easter egg with Yvonne, Anke and Paul during our ‘market presentation’. They all had trouble finding the easter egg. And that shows how hard it can be to test an easter egg.\n\n**Interactive Prototype:** The redesigned Fontys ICT for Professionals site incorporates an interactive easter egg triggered by entering the Konami code. Upon successful input, the site undergoes a 'matrixification' effect, where the visual elements are changed to look like the user steps into the Matrix, with everything becoming green on black with cascading text.\n\n**Relevant tech media and design landscape:** The incorporation of an easter egg into the site is different \n\n**Reflection:** This was a fun project. Trying to come up with way to improve the website, testing those improvements and refining was challenging but rewarding. Creating the easter egg was a lot of fun and during this project I’ve definitely learned how we can effectively work together. Being a group of three during the development phase brought with it some challenges. Merge conflicts were one thing, but also maintaining a clear project set up was difficult. We each had different ways of coding and especially parts like the CSS file used a bunch of different layouts. We did however make it clear from the beginning that we should use variables. This meant that we didn’t have multiple shades of purple or pixel heights for the same things. That made working together a lot better. \n\nDuring the research part, I was in a different team. There sadly was a general lack of motivation among my teammates and one of them quit after that part of the project was finished, leaving with half finished work. If I were to start over again with this part, I would put more focus towards organisation and setting clear rules. \n\n Including the Konami code easter egg was a way to cater to a potential segment of the target audience who might appreciate a subtle, nerdy reference. While maintaining a professional tone for the site overall, this unobtrusive interactive element adds a touch of fun to a project that doesn’t necessarily has ‘being fun’ as a target."
        },
        {
            "title": "Subshootica",
            "imagefile": "images/project3.jpg",
            "imagelink": "subshootica.html",
            "description": "Development challenge",
            "projectcontent": "Subshootica is a clickbable prototype in game form. Originally made from a challenge during development class, it has grown into a fully functioning game. \n\n_User testing_: My game received the most user testing of any project I’ve made in the second semester. And I’ve been refining my game based on testing and feedback received by students and teachers. Including observing how people play and experience the gameplay loop. \n\nI have made adjustments and retested my game often and iterated on it thanks to the [feedback I’ve received.](projects/group/soundwave/feedback/feedback.html) \n\n **Click on the image to play the game**"
        }
    ]
}