{
    "title": "Iterative Design",
    "bordercolor": "#50ef5a",
    "imagefile": "",
    "description": "Explained here are iterative design processes as well as the software used.",
    "pagecontent": "",
    "projects": [
        {
            "title": "Soundwave Studio",
            "imagefile": "images/project1.jpg",
            "imagelink": "projects/group/soundwave/iterations/iterations.html",
            "description": "Group project 1",
            "projectcontent": "**Design** With the Soundwave Studio design process I’ve started with creating digital sketches of initial logo designs, the name and font and colour choice. I continued with a mood board to get a feel of where the design should be moving towards. This is also influenced by feedback I’ve received from our client as well as fellow students. We had our target audience decide on which logo has the best look and feel. Two of them won and we combined them into one, each group member creating a refined version of the logo. Mine was the final chosen logo after a second round of polling. I used this logo to iteratively build the design of the entire brand guide.\n\n_Professional software_: I've been a Photoshop and other Adobe software user for many years but my preferred software suite to work with is Affinity. I've been using it a lot for the past 7 or so years and the [logos and brand guide](projects/group/soundwave/brandguide/brandguide.html) were made by me in Affinity Photo, Designer and Publisher. \n\n In the brand guide there are explinations for colour and font choices, as well as common design rules such as placement and do's and don'ts.\n\n**Click on the image to see a gallery of the iterations and some explinations**"
        },
        {
            "title": "Fontys OVP",
            "imagefile": "images/project2.jpg",
            "imagelink": "projects/group/soundwave/ovpredesign/ovpredesign.html",
            "description": "Group project 2",
            "projectcontent": "For the Fontys OVP site I've made mockups of potential advertising as well as a mockup for the easter egg (T.B.D.). I've also made a few different versions of the logo and the site design. I've also made a few different versions of the background and the UI. \n\n**Click on the image to see a gallery of the iterations and some explinations**"
        },
        {
            "title": "Personal Portfolio",
            "imagefile": "images/project3.jpg",
            "imagelink": "projects/group/soundwave/portfolio/portfolio.html",
            "description": "",
            "projectcontent": "My portfolio has seen many different iterations. Starting from learning how to use Javascript better and making a few experiments for my site design, then receiving feedback and starting again but this time instead of beginning with programming an developing the design from there, I collected inspiration."
        },
        {
            "title": "Challenges",
            "imagefile": "images/project4.jpg",
            "imagelink": "projects/group/soundwave/challenges/challenges.html",
            "description": "Subshootica",
            "projectcontent": "In terms of using appropriate software for this projects, I have used Aseprite next to Affinity Photoshop. Aseprite is a semi-professional pixel art software that I've been using for a few years now. And using my iPad as a drawing tablet allows me to have fine control. Aseprite is more suited for creating _Gameboy_ style graphics than Affinity Photo because it is made with pixel art in mind. \n\n_Iterations_: Thanks to the feedback I've received from my peers I've been able to iterate on the design of the game. I've made a few different versions of the main character and the enemies. I've also made a few different versions of the background and the UI. \n\n**Click on the image to see a gallery of the iterations and some explinations**"
        }
    ]
}