{
    "title": "Personal Leadership",
    "bordercolor": "#fa99e1",
    "imagefile": "",
    "description": "I definitely feel like I’ve grown a lot this semester, I’ve asked for feedback even more than before and learned a lot of things about Media which I’ve never heard of before. I enjoy talking with others, teachers and students alike, about interesting things in the Media landscape, and this inspires me to create more interesting things.",
    "pagecontent": "",
    "projects": [
        {
            "title": "Identifying my core values",
            "imagefile": "images/project1.jpg",
            "imagelink": "projects/group/soundwave/figma/figma.html",
            "description": "",
            "projectcontent": "I feel it is difficult to decide which direction I would like to take in Media. I often hear from teachers that the development side suits me well, but I really enjoy designing. I think it would be best to find something that combines these things. During this semester I have been busy asking for feedback on my projects and then of course processing it. This is all described in detail in the previous learning outcomes.\n\nI definitely feel like I’ve grown a lot this semester, I’ve asked for feedback even more than before and learned a lot of things about Media which I’ve never heard of before. I enjoy talking with others, teachers and students alike, about interesting things in the Media landscape, and this inspires me to create more interesting things.\n\nI will admit that I sometimes still feel a bit out of place. That’s not as much an issue with Fontys as it is an issue with how I personally feel like I’d like to learn.\n\nIf I were to choose right now, I would like to go in a direction which involves making interactive projects. Most likely on the web but my other interests like designing and working with new tech are preferably incorporated as well."            
        },
        {
            "title": "Career day",
            "imagefile": "images/project2.jpg",
            "description": "",
            "projectcontent": "On the 18th of April I went to the Career Day on Strijp-TQ. My goal was to learn more aout what minors were able to be chosen and which fit me as a Media student. I also wanted to see which companies had stands and what they were looking for in a student. Sadly, most of them focused on the largest groups of students, in the fields of software and infrastructure. For me this seemed a bit concerning, but I know that you of course can’t have every company here and most are still looking for media related employees, but they hadn’t thought of it at that moment."
        },
        {
            "title": "Portfolio",
            "imagefile": "images/project3.jpg",
            "imagelink": "projects/group/soundwave/feedback/feedback.html",
            "description": "Feedback about my portfolio",
            "projectcontent": "I often ask for feedback about my portfolio, and I actively discuss feedback I’ve received with many different teachers. This allows me to get different point of view about how my development is moving along. \n\nThe feedback I receive helps me identify my own core values by hearing how others see my work instead of thinking something is ‘finished’ and not looking at it again. \n\n It also helps me to get a sense of what I want to do with my portfolio and my other projects. Getting feedback from different people is important to me simply because it gives me new ideas which I might have otherwise never thought about. \n\n **Click on the image to see the feedback I've received about my portfolio**"
        }
    ]
}