{
    "title": "Personal Leadership",
    "bordercolor": "#fa99e1",
    "imagefile": "",
    "description": "I definitely feel like I’ve grown a lot this semester, I’ve asked for feedback even more than before and learned a lot of things about Media which I’ve never heard of before. I enjoy talking with others, teachers and students alike, about interesting things in the Media landscape, and this inspires me to create more interesting things.",
    "pagecontent": "",
    "projects": [
        {
            "title": "Soundwave Studio",
            "imagefile": "images/project1.jpg",
            "description": "Soundwave",
            "projectcontent": "We've asked feedback of other students and teachers about our project. We've also asked feedback from the client, and we've iterated on the projects thanks to the feedback we've received. On the first day of the project we sat with our stakeholder and I asked him what he wanted to see in the project. I also asked him what he didn't want to see in the project. This helped me to understand what he wanted and what he didn't want. Showing initial concepts of the name and logos of the project on the first day immediately helped us to get a sense of direction for the project."
        },
        {
            "title": "OVP",
            "imagefile": "images/project2.jpg",
            "description": "Group project 2",
            "projectcontent": "For this project after the half way presentation we've received feedback and I worked with this to further the development of the campaign."
        },
        {
            "title": "Portfolio",
            "imagefile": "images/project3.jpg",
            "imagelink": "projects/group/soundwave/feedback/feedback.html",
            "description": "Feedback about my portfolio",
            "projectcontent": "I often ask for feedback about my portfolio, and I actively discuss feedback I’ve received with many different teachers. This allows me to get different point of view about how my development is moving along. \n\nThe feedback I receive helps me identify my own core values by hearing how others see my work instead of thinking something is ‘finished’ and not looking at it again. \n\n It also helps me to get a sense of what I want to do with my portfolio and my other projects. Getting feedback from different people is important to me simply because it gives me new ideas which I might have otherwise never thought about. \n\n **Click on the image to see the feedback I've received about my portfolio**"
        }
    ]
}