{
    "title": "Professional standards",
    "bordercolor": "#f0d84b",
    "imagefile": "",
    "description": "Regarding professional standards I have a few key points that I wish to highlight. These are personal leadership, time management and presentation skills. I will explain these points in the projects below.",
    "pagecontent": "",
    "projects": [
        {
            "title": "Soundwave Studio",
            "imagefile": "images/project1.jpg",
            "imagelink": "projects/group/soundwave/feedback/feedback.html",
            "description": "Groep project 1",
            "projectcontent": "**Feedback**: On the very first day of the project, I’ve made some sketches to get a general feeling for the project and showed it to our client, Josh. With the feedback received I continued to refine the name and design. As a group we asked feedback on our created logos later in the project and I took the. \n\n **Time management**: During the project I worked on my tasks with enough time to spare to receive feedback. It’s important for me to finish aspects of the project before the deadline so that I can have a ‘buffer zone’ and make changes if a problem arises. This was the case with the final brand guide for Soundwave Studio as well. \n\n **Presentation skills**: I presented the final brand guide to the client and received feedback on the project. I was able to explain the choices made in the design and the reasoning behind it. I also showed the client the logo in different contexts to show the versatility of the design. \n\n **Planning**: I made a Trello board for the group to keep track of the project and to make sure that the project was finished on time. I also made a planning for myself to make sure that I was on track with my tasks. [show Trello board] \n\n **Exploratory Research**: During the initial phase, I used the Define stage of the DOT framework to gather information from Josh about Soundwave Studio's target audience and brand identity. Through observation (Observe stage), we analyzed competitor logos and design trends. We then presented initial logo concepts (Test stage) and refined them based on Josh's feedback. [analyse] \n\n **Reflection**: Sadly the project didn’t always go so well as I had hoped, communication with both the stakeholder and my team members wasn’t the best. There was conflict about how the project should go and who should do what and when. As a result the Trello board wasn’t actively followed. I desperately wanted to show something nice in the final presentations and the brand guide wasn’t coming along so well which is why I made one entirely myself. Not everyone was motivated on the same level sadly."
        },
        {
            "title": "Fontys OVP",
            "imagefile": "images/project2.jpg",
            "imagelink": "projects/group/soundwave/implementatie/implementatie.html",
            "description": "Groep project 2",
            "projectcontent": "For this project I have analysed the current website of Fontys OVP and made a list of improvements. I’ve also made some adjustments of the site based on what I see in competitors and what I think is missing or important on the site. \n\n_Planning_ I have also made a [Trello board](images/trello.png) which sadly wasn't always followed by the group. But I did my best to keep the group on track and to make sure that the project was finished on time. \n\n I have of course documented all of the things I and our group has done for the project into a document. \n\n_Implementation plan_: I have made a 10 step implementation plan for if the Fontys OVP advertising campaign should be launched. There's a timeline, hypothetical budget based on sources and a list of things that need to be done. The plan is well documented and was given to our stakeholder during the presentation. This research uses parts of the DOT framework.\n\n **Click on the image to see the documentation including the implementation plan**"
        },
        {
            "title": "Portfolio",
            "imagefile": "images/project3.jpg",
            "imagelink": "projects/group/soundwave/feedback/feedback.html",
            "description": "Feedback about my portfolio",
            "projectcontent": "I often ask for feedback about my portfolio, and I actively discuss feedback I’ve received with many different teachers. This allows me to get different point of view about how my development is moving along. \n\nThe feedback I receive helps me identify my own core values by hearing how others see my work instead of thinking something is ‘finished’ and not looking at it again."
        },
        {
            "title": "Project X: 'Find 'n learn'",
            "imagefile": "images/project4.jpg",
            "imagelink": "projects/group/soundwave/feedback/feedback.html",
            "description": "",
            "projectcontent": "**Context:** \n\n **Explanatory research:** This project contained a lot of essential research. Important aspects were finding the issues students and teachers experienced in terms of information, asking questions and giving appropriate answers. I made a document in which I set up the project. It first consists of literature study in which I find out what information is available to students and teachers. After that there are questions to be asked which roughly followed these lines in terms of research:\n\n• Do people ask for questions a lot, what kind of questions are asked most often?\n\n• Are the issues experienced with finding correct answers?\n\n• But also, are there frustrations in having to ask teachers certain questions that might feel simple but require more effort?\n\n This was the basis for the project and the basis for the first batch of interviews, according to the CMD methods it’s often best to interview around 5 people. It was important to make questions that would fit students and different questions of teachers, to get a different perspective. After iterating and testing there is a field trial of \n\n **Reporting:** For this project I had Dennis as my coach, and we discussed reporting. It was important for me to set up"
        }
    ]
}